{"Mtype": "poll", "Title": "Round 4", "Options": {"65": "The sequel to Very Vixen Mike & Erilas, Erilas decides to take VV Mike on a date and has her wear one of her spare casual dresses, much to VV Mike's embarrassment and Erilas' happiness.", "66": "Lynx Reed being told she's pregnant with the Prince's children, with the obvious reaction, thankfully it was just a dream", "67": "Trace walks in on Saria and Rose in a (unintentional) compromising position. Trace being supportive makes it much more awkward", "68": "The Great Chicken Heist.  Laura Schemes, Capt. Jenny and Mike pull off a heist on a large scale chicken farm.", "69": "Scene-girl Kat", "70": "Trace Transformed into a Magical Tigress Girl", "71": "Mary and Euchre come home to find puppy Raine and a young Reni walking around on the ceiling using magic, watched by a tired Rose.", "72": "Follow up to Grand Templar Laura 2 and King Madness. Madelyn meets with Grand Templar Laura to negotiate Keith's return, but for some reason Keith seems mysteriously reluctant to leave.", "73": "Sealeen chairing a meeting of the 'Trace fanclub'. (the only other members are Flora, Karen, and an embarrassed Red)", "74": "Half Kind Lt. Reed: the collars lingering side effects are impossible to conceal now - Alice doesn’t seem too concerned about it. ", "75": "A police mug shot of Skater Kat", "76": "Raccoon girl and Officer Vicky on another date, showing her around the park maybe? ", "77": "AU: A Keidran terminator is sent back in time to protect Flora and unborn baby", "78": "Keith dressed as a British Admiral, Full Dress, Circa 1805, during the Napoleonic wars, sword aloft as he commands his ship to battle.", "79": "Very Tod Mike - our boy Mike, but manlier", "80": "Modern Keith and Natani take Laura to the gun range. She’s terrifyingly good at it.", "81": "Flora using a snake transformation collar to get the snitties, but they are also missing(flat). Viper gal is also confused.", "82": "Alaric proposes to Keith at a Basitin festival. Keith accepts as fireworks go off!", "83": "Keith being a pretty princess ", "84": "Windstraw and Amelia play 2-player spin the bottle. Windstraw doesn’t know the rules and drinks from the bottle when it lands on her instead.", "85": "Raine/Rose AU: Raine and Reni work on a model volcano for a school science project. Nora finds the end result to be rather boring. She decides to help the girls out by spicing up their model with a bit of dragon magic.", "86": "Martlet and Ceroba, from Undertale Yellow, find themselves in Mekkan. Unsure of how they got there or where their friends are, they go on an adventure together to find out.", "87": "Carver gets his head pats", "88": "A happy modern Flora points to the Flora plushy announcement on modern trio's computer screen, proudly announcing, \"See? It's me! I'm sure he'll do ones of you guys, too, but he did ME first!\" (or something like that)", "89": "Sythe is ammused watching wolf Maren trying to lick a snowflake off her muzzle for the first time.", "90": "Valentine Magical Lynx Dates: Both in jewelry only, Prince offers magical date dishes (fruit!) to blushy Reed. \"We even asked our Edinmire allies to help against Templar smugglers!\"", "97": "Amelia and Windstraw enjoying a last pint of ale after closing the tavern for the night", "98": "Trace and Laura having a moment of quiet intimacy and romance in bed, conveying feelings of love and devotion between them. (Kiss included)"}, "Ends": 1739163622, "SecondsLeft": 22}