{"Mtype": "poll", "Title": "Round 3", "Options": {"65": "Good morning Proto-Flora/Kaylia", "66": "Prequel to the Halloween sketch with Reni and Raine showing how the two of them first meet in kindergarten, with one shyly asking something along the lines of \"do you like crystals?\". Leading to them quickly becoming friends ", "67": "Adira teaching Raine how to play the Violin.", "68": "Amelia and Windstraw body pillows. Amelia’s is alluring and seductive. Windstraw’s tries to mimic Amelia’s but its a cute funny cat parody of it", "69": "Mermaid Laura washes ashore.  This time it's Keith that comes to her rescue.", "70": "Sequel to Bottom-Fishing: Reni’s top is snagged by Laura and Flora, to her and Laura’s great embarrassment but Flora pouting over their comparative bust sizes.", "71": "Rose exchanges housekeeping tips with Von Lycaon from Zenless zone zero ", "72": "Kat is tasked to design a skirt for the Xcom viper lady,set in her workshop taking mesurments. She finds the strange anatomy a challenge to work with,especially for a creature with no legs and yet an extensive rear end.", "73": "Nat and Zen as Mario and Luigi", "74": "Maeve tries coffee and gets the zoomies and causes havoc around the tavern.", "75": "Pinup of Laura and Natani as the driver & fire stoker of a steam train. Laura dressed smartly in her dungarees and cap, while Natani looks hot and sweaty with his overalls half off, holding a shovel", "76": "Flora shows off her plushie to everyone! They are all low-key jealous, especially Natani...", "77": "Amelia walks thru a snow blizzard to the Riftwall", "78": "Good morning Karen", "79": "Trace and Flora notice you're feeling sad, so they both offer you a hug", "80": "Continuation of Laura Therapy, with Laura being caught with a tied up Keith pillow ", "81": "Santa-Mike makes a New Year's resolution to get gender-swapped less, resulting in Evals waking up on the first of the year still a reindeer girl.", "82": "Semi Modern Sequel to Breaking Decency Laws: Modern Keith and Alaric streak across the football field during the Super Bowl. Keith wonders how Alaric can talk him into these things.", "83": "Sequel to Nayana and Koan AU", "84": "Valentine's: Mike gives Evals a lovely box of chocolates to show his love, followed by Evals having Theobromine poisoning because he is a dog ", "85": "Now busty but still male Keith casually wearing the other end of Natani's Binders of Holding so Natani doesn't have to deal with getting chatted up at the tavern. Naturally, its now Keith drawing the attention.", "86": "Natani and 6 pack Kat working out together", "87": "Conceptual idea for a Bear Keidran. ", "88": "Flat Fox Fashion 2: If Laura won't wear the top half of her bikini, maybe her *other half* will. Laura and Keith (begrudgingly, and in his fox form) model opposite halves of the same bikini.", "89": "Rooftop Stargazing - Laura & Flora lying on a cabin roof while stargazing in the night", "90": "Good Morning Human Nora", "97": "Keith's Boobhat Redux", "98": "Maren grooming Raine"}, "Ends": 1739156479, "SecondsLeft": 452}