{"Mtype": "poll", "Title": "Round 2", "Options": {"100": "Laura helps Willow make her first online order.  Meanwhile in the warehouse, a forklift driver hits a shelf, causing all the aisles to collapse like dominoes.", "65": "Kat dressed in Rouge the Bat’s outfit", "66": "Flora with a Ditto face. Trace is rather concerned...", "67": "Alaric has a ‘Oh, sh*t’ moment as he wakes up to a hangover with male Keith on one side, female Keith on the other, and a pile of empty Western Basitin Rum bottles on the end table.", "68": "This meme https://imgur.com/3NR10Gi but it's Eric being hounded by a mob of angry keidran women.", "69": "Kat trying something new: a cooking show!", "70": "Tiger Trace, Flora, Keith, and Natani lounging in a communal Kiedran bed.", "71": "The moment Rose was discovered/captured during the Chapter 16 flashback", "72": "Goth Flora takes Kathrin to Hot Topic for the first time! Flora is surprised how into it she is...", "73": "Natani cosplays Agent 007. Bond, James Bond", "74": "1 or 2 of the female lynxes discover Reed's secret. Instead of exposing her, they're giving her tips on how to be a proper lynx lady.", "75": "Keith, Natani, Flora and Trace go on a double Valentine's date.", "76": "Flora bare booty appreciation suggestion as a Haiku: Human Pyramid. Flora is on top of you. Stargazing viewer. ", "77": "The sequel to Very Vixen Mike & Erilas, Erilas decides to take VV Mike on a date and has her wear one of her spare casual dresses, much to VV Mike's embarrassment and Erilas' happiness.", "78": "Nurse Raine", "79": "Saria as the High Templar, attended by Rose", "80": "Valentine Magical Lynx Dates: Both in jewelry only, Prince offers magical date dishes (fruit!) to blushy Reed. \"We even asked our Edinmire allies to help against Templar smugglers!\"", "81": "DJ Dragon proposing to Sera with a big \"Sera, Will You Marry Me?\" on the board behind him during a music session, but a glitch removes Sera and makes it a generic \"Will You Marry Me?\", leading to a lot of confused couples", "82": "Rose exchanges housekeeping tips with Von Lycaon from Zenless zone zero ", "83": "Nora turns Trace, Flora, Natani and Keith into marketable plushies", "84": "Good morning Protoflora/Kaylia", "85": "Alaric proposes to Keith at a Basitin festival. Keith accepts as fireworks go off!", "86": "Maddie chasing an army of crabs that stole her armor as they chant “shiny”", "87": "Follow up to Grand Templar Laura 2 and King Madness. Madelyn meets with Grand Templar Laura to negotiate Keith's return, but for some reason Keith seems mysteriously reluctant to leave.", "88": "Amelia and Windstraw body pillows. Amelia’s is alluring and seductive. Windstraw’s tries to mimic Amelia’s but its a cute funny cat parody of it", "89": "Laura lounges on a translucent blue whale inflatable pool toy, floating on the sea.", "90": "Flora and her plushies confuse tiger Trace ", "97": "Good morning very vixen Mike.", "98": "Human Nora in Halloween costume", "99": "Santa-Mike makes a New Year's resolution to get gender-swapped less, resulting in Evals waking up on the first of the year still a reindeer girl."}, "Ends": 1739757680, "SecondsLeft": 608}